<?php
require_once 'db_config.php';
require_once 'php/pdo.class.php';


// echo getcwd() . "\n";

/*
$a = ['Зеркало','Масла','Шины','Диски','Колеса','Глушители','Капот','Щетки','Аккумуляторы',
    'Бампер','Колодки','Мотор','Двигатель','Руль','Фары','Багажник','Сидение','Огнетушитель',
    'Домкрат','Магнитола','Ксенон','Аэрография','Коробка передач', 'Аптечка', 'Тосол', 'Антифриз',
'Подушка безопасности','Мотошины','Автохимия','Аксессуары','Мото аксессуары', 'Инструмент'];
*/
/*
$db = Database::getInst();
$a = array(326,327,328,329,330,331,332);

echo'ok - '.$upd;
//for


*/